<?php 

$ebook = array($ebook1, $ebook2, $ebook3);

$joinedEbooks = implode(", ", $ebook);

$cycleBooks = array(
    "Перша" => new FictionBook("Гаррі Поттер і філософський камінь", "Джоан Роулінг", 1997, "978-5-389-03028-6", 10),
    "Друга" => new FictionBook("Гаррі Поттер і таємна кімната", "Джоан Роулінг", 1998, "978-5-389-03029-3", 8),
    "Третя" => new FictionBook("Гаррі Поттер і в'язень Азкабану", "Джоан Роулінг", 1999, "978-5-389-03030-9", 7),
    "Четверта" => new FictionBook("Гаррі Поттер і Келих Вогню", "Джоан Роулінг", 2000, "978-5-389-01280-2", 9),
    "П'ята" => new FictionBook("Гаррі Поттер і Орден Фенікса", "Джоан Роулінг", 2003, "978-5-389-03032-3", 6),
);